Update lecture_02_stream_processing.md
